ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/inc/ht32l5xxxx_ckcu.h
/*********************************************************************************************************//**
 * @file    ht32l5xxxx_ckcu.h
 * @version $Rev:: 460          $
 * @date    $Date:: 2024-07-11 #$
 * @brief   The header file of the Clock Control Unit library.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------------------------------------*/
#ifndef __HT32L5XXXX_CKCU_H
#define __HT32L5XXXX_CKCU_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"

/** @addtogroup HT32L5xxxx_Peripheral_Driver HT32L5xxxx Peripheral Driver
  * @{
  */

/** @addtogroup CKCU
  * @{
  */


/* Exported types ------------------------------------------------------------------------------------------*/
/** @defgroup CKCU_Exported_Types CKCU exported types
  * @{
  */

/**
 * @brief Enumeration of APB peripheral prescaler.
 */
typedef enum
{
  CKCU_APBCLKPRE_DIV1 = 0,
  CKCU_APBCLKPRE_DIV2,
  CKCU_APBCLKPRE_DIV4,
  CKCU_APBCLKPRE_DIV8,
  CKCU_APBCLKPRE_DIV16,
  CKCU_APBCLKPRE_DIV32
} CKCU_APBCLKPRE_TypeDef;

/**
 * @brief Enumeration of CK_REF prescaler.
 */
typedef enum
{
  CKCU_CKREFPRE_DIV2 = 0,
  CKCU_CKREFPRE_DIV4,
  CKCU_CKREFPRE_DIV6,
  CKCU_CKREFPRE_DIV8,
  CKCU_CKREFPRE_DIV10,
  CKCU_CKREFPRE_DIV12,
  CKCU_CKREFPRE_DIV14,
  CKCU_CKREFPRE_DIV16,
  CKCU_CKREFPRE_DIV18,
  CKCU_CKREFPRE_DIV20,
  CKCU_CKREFPRE_DIV22,
  CKCU_CKREFPRE_DIV24,
  CKCU_CKREFPRE_DIV26,
  CKCU_CKREFPRE_DIV28,
  CKCU_CKREFPRE_DIV30,
  CKCU_CKREFPRE_DIV32,
  CKCU_CKREFPRE_DIV34,
  CKCU_CKREFPRE_DIV36,
  CKCU_CKREFPRE_DIV38,
  CKCU_CKREFPRE_DIV40,
  CKCU_CKREFPRE_DIV42,
  CKCU_CKREFPRE_DIV44,
  CKCU_CKREFPRE_DIV46,
  CKCU_CKREFPRE_DIV48,
  CKCU_CKREFPRE_DIV50,
  CKCU_CKREFPRE_DIV52,
  CKCU_CKREFPRE_DIV54,
  CKCU_CKREFPRE_DIV56,
  CKCU_CKREFPRE_DIV58,
  CKCU_CKREFPRE_DIV60,
  CKCU_CKREFPRE_DIV62,
  CKCU_CKREFPRE_DIV64
} CKCU_CKREFPRE_TypeDef;

#if (!LIBCFG_NO_PLL)
/**
 * @brief Enumeration of PLL clock source.
 */
typedef enum
{
  CKCU_PLLSRC_HSE = 0,
  CKCU_PLLSRC_HSI
} CKCU_PLLSRC_TypeDef;

#define IS_PLL_CLKSRC(SRC)      ((SRC == CKCU_PLLSRC_HSE) || \
                                 (SRC == CKCU_PLLSRC_HSI))
#endif

#if (LIBCFG_CKCU_USB_PLL)
/**
 * @brief Enumeration of CK_USB clock source.
 */
typedef enum
{
  CKCU_CKPLL    = 0,
  CKCU_CKUSBPLL
} CKCU_USBSRC_TypeDef;
#endif

#if (LIBCFG_CKCU_LCD_SRC)
/**
 * @brief Enumeration of CK_LCD clock source.
 */
typedef enum
{
  CKCU_LCDSRC_LSI = 0,
  CKCU_LCDSRC_LSE,
  CKCU_LCDSRC_HSI,
  CKCU_LCDSRC_HSE
} CKCU_LCDSRC_TypeDef;
#endif

#if ((LIBCFG_USBD) || (LIBCFG_CKCU_REFCLK_EXT_PIN))
/**
 * @brief Enumeration of HSI auto-trim clock source.
 */
typedef enum
{
  CKCU_ATC_LSE = 0,
  #if (LIBCFG_USBD)
  CKCU_ATC_USB = 1,
  #endif
  #if (LIBCFG_CKCU_REFCLK_EXT_PIN)
  CKCU_ATC_CKIN = 2,
  #endif
} CKCU_ATC_TypeDef;
#endif

/**
 * @brief Enumeration of ATC search algorithm.
 */
typedef enum
{
  CKCU_ATC_BINARY_SEARCH = 0,
  CKCU_ATC_LINEAR_SEARCH = 8
} CKCU_ATCSearchAlgorithm_TypeDef;

/**
 * @brief Enumeration of ATC frequency tolerance.
 */
typedef enum
{
  CKCU_ATC_DOUBLE_PRECISION = 0,
  CKCU_ATC_SINGLE_PRECISION = 4
} CKCU_ATCFrqTolerance_TypeDef;

/**
 * @brief Enumeration of CK_AHB prescaler.
 */
typedef enum
{
  CKCU_SYSCLK_DIV1 = 0,
  CKCU_SYSCLK_DIV2,
  CKCU_SYSCLK_DIV4,
  CKCU_SYSCLK_DIV8,
  CKCU_SYSCLK_DIV16,
  CKCU_SYSCLK_DIV32
} CKCU_SYSCLKDIV_TypeDef;

/**
 * @brief Enumeration of CK_ADC prescaler.
 */
typedef enum
{
  CKCU_ADCPRE_DIV1 = 0,
  CKCU_ADCPRE_DIV2 = 1,
  CKCU_ADCPRE_DIV4,
  CKCU_ADCPRE_DIV8,
  CKCU_ADCPRE_DIV16,
  CKCU_ADCPRE_DIV32,
  CKCU_ADCPRE_DIV64,
  CKCU_ADCPRE_DIV3
} CKCU_ADCPRE_TypeDef;

/**
 * @brief Enumeration of CK_ADCn.
 */
typedef enum
{
  CKCU_ADCPRE_ADC0 = 16,
  #if (LIBCFG_ADC1)
  CKCU_ADCPRE_ADC1 = 20,
  #endif
} CKCU_ADCPRE_ADCn_TypeDef;

#if (LIBCFG_LCD)
/**
 * @brief Enumeration of CK_LCD prescaler.
 */
typedef enum
{
  CKCU_LCDPRE_DIV1 = 0,
  CKCU_LCDPRE_DIV2,
  CKCU_LCDPRE_DIV4,
  CKCU_LCDPRE_DIV8,
  CKCU_LCDPRE_DIV16,
} CKCU_LCDPRE_TypeDef;
#endif

#if (LIBCFG_MIDI)
/**
 * @brief Enumeration of CK_MIDI prescaler.
 */
typedef enum
{
  CKCU_MIDIPRE_DIV16 = 0,
  CKCU_MIDIPRE_DIV13,
  CKCU_MIDIPRE_DIV11,
  CKCU_MIDIPRE_DIV9,
  CKCU_MIDIPRE_DIV8,
} CKCU_MIDIPRE_TypeDef;
#endif

/**
 * @brief Enumeration of System clock source.
 */
typedef enum
{
#if (!LIBCFG_NO_PLL)
  CKCU_SW_PLL = 1,
#endif
  CKCU_SW_HSE = 2,
  CKCU_SW_HSI = 3,
  CKCU_SW_LSE = 6,
  CKCU_SW_LSI = 7
} CKCU_SW_TypeDef;

/**
 * @brief Enumeration of CKOUT clock source.
 */
typedef enum
{
  CKCU_CKOUTSRC_REFCK       = 0,
  CKCU_CKOUTSRC_HCLK_DIV16  = 1,
  CKCU_CKOUTSRC_SYSCK_DIV16 = 2,
  CKCU_CKOUTSRC_HSECK_DIV16 = 3,
  CKCU_CKOUTSRC_HSICK_DIV16 = 4,
  CKCU_CKOUTSRC_LSECK       = 5,
  CKCU_CKOUTSRC_LSICK       = 6
} CKCU_CKOUTSRC_TypeDef;

#if (!LIBCFG_NO_PLL)
/**
 * @brief Enumeration of PLL clock source status.
 */
typedef enum
{
  CKCU_PLLST_SYSCK  = 1,
  #if (LIBCFG_USBD)
  CKCU_PLLST_USB    = 4,
  #endif
  CKCU_PLLST_REFCK  = 8
} CKCU_PLLST_TypeDef;
#endif

/**
 * @brief Enumeration of HSI clock source status.
 */
typedef enum
{
  CKCU_HSIST_SYSCK  = 1,
#if (!LIBCFG_NO_PLL)
  CKCU_HSIST_PLL    = 2,
#endif
  CKCU_HSIST_CKM    = 4
} CKCU_HSIST_TypeDef;

/**
 * @brief Enumeration of HSE clock source status.
 */
typedef enum
{
  CKCU_HSEST_SYSCK  = 1,
#if (!LIBCFG_NO_PLL)
  CKCU_HSEST_PLL
#endif
} CKCU_HSEST_TypeDef;

/**
 * @brief Definition of CKOUT Init Structure.
 */
typedef struct
{
  CKCU_CKOUTSRC_TypeDef CKOUTSRC;
} CKCU_CKOUTInitTypeDef;

#if (!LIBCFG_NO_PLL)
/**
 * @brief Definition of PLL Init Structure.
 */
typedef struct
{
  u32 CFG;
  CKCU_PLLSRC_TypeDef ClockSource;
  ControlStatus BYPASSCmd;
} CKCU_PLLInitTypeDef;
#endif

/**
 * @brief Definition of structure for clock frequency.
 */
typedef struct
{
#if (!LIBCFG_NO_PLL)
  u32 PLL_Freq;
#endif
  u32 SYSCK_Freq;
  u32 HCLK_Freq;
#if (HT32_LIB_ENABLE_GET_CK_ADC)
  u32 ADC0_Freq;
#if (LIBCFG_ADC1)
  u32 ADC1_Freq;
#endif
#endif
} CKCU_ClocksTypeDef;

/**
 * @brief Definition of ATC Init Structure.
 */
typedef struct
{
  CKCU_ATCSearchAlgorithm_TypeDef SearchAlgorithm;
  CKCU_ATCFrqTolerance_TypeDef FrqTolerance;
} CKCU_ATCInitTypeDef;

/**
 * @brief Definition of initial structure of peripheral clock control.
 */
typedef union
{
  struct
  {
    /* Definitions of AHB clock control                                                                     */
    unsigned long FMC        :1;    // Bit 0
    unsigned long            :1;    // Bit 1
    unsigned long SRAM       :1;    // Bit 2
    unsigned long            :1;    // Bit 3
    unsigned long PDMA       :1;    // Bit 4
    unsigned long BM         :1;    // Bit 5
    unsigned long APB        :1;    // Bit 6
    unsigned long            :1;    // Bit 7

    unsigned long            :1;    // Bit 8
    unsigned long            :1;    // Bit 9
    unsigned long USBD       :1;    // Bit 10
    unsigned long CKREF      :1;    // Bit 11
    unsigned long EBI        :1;    // Bit 12
    unsigned long CRC        :1;    // Bit 13
    unsigned long            :1;    // Bit 14
    unsigned long AES        :1;    // Bit 15

    unsigned long PA         :1;    // Bit 16
    unsigned long PB         :1;    // Bit 17
    unsigned long PC         :1;    // Bit 18
    unsigned long PD         :1;    // Bit 19
    unsigned long PE         :1;    // Bit 20
    unsigned long PF         :1;    // Bit 21
    unsigned long            :1;    // Bit 22
    unsigned long            :1;    // Bit 23

    unsigned long DIV        :1;    // Bit 24
    unsigned long QSPI       :1;    // Bit 25
    unsigned long RF         :1;    // Bit 26
    unsigned long            :1;    // Bit 27
    unsigned long            :1;    // Bit 28
    unsigned long            :1;    // Bit 29
    unsigned long            :1;    // Bit 30
    unsigned long            :1;    // Bit 31

