ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/inc/ht32l5xxxx_ckcu.h
#define CKCU_PCLK_ADC CKCU_PCLK_ADC0
/**
  * @}
  */

/* Exported constants --------------------------------------------------------------------------------------*/
/** @defgroup CKCU_Exported_Constants CKCU exported constants
  * @{
  */

/* Definitions of clock ready flag                                                                          */
#if (LIBCFG_CKCU_USB_PLL)
#define CKCU_FLAG_USBPLLRDY     (1UL)
#endif
#if (!LIBCFG_NO_PLL)
#define CKCU_FLAG_PLLRDY        (1UL << 1)
#endif
#define CKCU_FLAG_HSERDY        (1UL << 2)
#define CKCU_FLAG_HSIRDY        (1UL << 3)
#define CKCU_FLAG_LSERDY        (1UL << 4)
#define CKCU_FLAG_LSIRDY        (1UL << 5)

#define IS_CKCU_FLAG(FLAG)      (((FLAG & 0xFFFFFFC0) == 0) && (FLAG != 0))

/* Definitions of clock interrupt & flag                                                                    */
#define CKCU_INT_CKS            (1UL)
#define IS_CKCU_INT_FLAG(FLAG)  (FLAG == CKCU_INT_CKS)

#define CKCU_INT_CKSIE          (1UL << 16)
#define IS_CKCU_INT(INT)        (((INT & 0xFFFEFFFF) == 0) && (INT != 0))

#if (!LIBCFG_NO_PLL)
/* Definitions of PLL frequency                                                                             */
#define CKCU_PLL_4M_48M         ((12UL << 23) | (0UL << 21))
#define CKCU_PLL_4M_40M         ((10UL << 23) | (0UL << 21))
#define CKCU_PLL_8M_48M         (( 6UL << 23) | (0UL << 21))
#define CKCU_PLL_8M_40M         (( 5UL << 23) | (0UL << 21))
#define CKCU_PLL_8M_32M         (( 4UL << 23) | (0UL << 21))
#define CKCU_PLL_12M_48M        (( 4UL << 23) | (0UL << 21))
#define CKCU_PLL_16M_48M        (( 3UL << 23) | (0UL << 21))

#if (LIBCFG_CKCU_SYS_CK_60M)
#define CKCU_PLL_4M_60M         ((0UL << 28) | (15UL << 23) | (0UL << 21))
#define CKCU_PLL_8M_60M         ((1UL << 28) | (15UL << 23) | (0UL << 21))
#define CKCU_PLL_12M_60M        ((0UL << 28) | ( 5UL << 23) | (0UL << 21))
#define CKCU_PLL_16M_56M        ((1UL << 28) | ( 7UL << 23) | (0UL << 21))
#endif

#define IS_PLL_CFG(CFG)         (((CFG & 0xE81FFFFF) == 0x0) && (CFG != 0))
#endif

#if (LIBCFG_CKCU_USB_PLL)
/* Definitions of USBPLL frequency                                                                          */
#if (LIBCFG_CKCU_USB_PLL_96M)
#define CKCU_USBPLL_4M_96M      ((24UL << 7) | (0UL << 5))
#define CKCU_USBPLL_8M_96M      ((12UL << 7) | (0UL << 5))
#define CKCU_USBPLL_12M_96M     (( 8UL << 7) | (0UL << 5))
#define CKCU_USBPLL_16M_96M     (( 6UL << 7) | (0UL << 5))
#else
#define CKCU_USBPLL_4M_48M      ((12UL << 7) | (0UL << 5))
#define CKCU_USBPLL_8M_48M      (( 6UL << 7) | (0UL << 5))
#define CKCU_USBPLL_12M_48M     (( 4UL << 7) | (0UL << 5))
#define CKCU_USBPLL_16M_48M     (( 3UL << 7) | (0UL << 5))
#endif

#define IS_USBPLL_CFG(CFG)      (((CFG & 0xFFFFF81F) == 0x0) && (CFG != 0))
#endif

/* Definitions of MCU debug control                                                                         */
#define CKCU_DBG_SLEEP          (1UL)
#define CKCU_DBG_DEEPSLEEP1     (1UL << 1)
#define CKCU_DBG_POWERDOWN      (1UL << 2)
#define CKCU_DBG_WDT_HALT       (1UL << 3)

#if (LIBCFG_MCTM0)
#define CKCU_DBG_MCTM0_HALT     (1UL << 4)
#endif

#if (!LIBCFG_NO_GPTM0)
#define CKCU_DBG_GPTM0_HALT     (1UL << 6)
#endif

#if (LIBCFG_GPTM1)
#define CKCU_DBG_GPTM1_HALT     (1UL << 7)
#endif

#if (!LIBCFG_NO_USART0)
#define CKCU_DBG_USART0_HALT    (1UL << 8)
#endif

#if (LIBCFG_USART1)
#define CKCU_DBG_USART1_HALT    (1UL << 9)
#endif

#define CKCU_DBG_SPI0_HALT      (1UL << 10)

#if (LIBCFG_SPI1)
#define CKCU_DBG_SPI1_HALT      (1UL << 11)
#endif

#define CKCU_DBG_I2C0_HALT      (1UL << 12)

#if (LIBCFG_I2C1)
#define CKCU_DBG_I2C1_HALT      (1UL << 13)
#endif

#define CKCU_DBG_DEEPSLEEP2     (1UL << 14)

#if (LIBCFG_SCI0)
#define CKCU_DBG_SCI0_HALT      (1UL << 15)
#endif

#define CKCU_DBG_BFTM0_HALT     (1UL << 16)

#if (LIBCFG_BFTM1)
#define CKCU_DBG_BFTM1_HALT     (1UL << 17)
#endif

#define CKCU_DBG_UART0_HALT     (1UL << 18)

#if (LIBCFG_UART1)
#define CKCU_DBG_UART1_HALT     (1UL << 19)
#endif

#if (LIBCFG_SCI1)
#define CKCU_DBG_SCI1_HALT      (1UL << 21)
#endif

#if (LIBCFG_SCTM0)
#define CKCU_DBG_SCTM0_HALT     (1UL << 22)
#endif

#if (LIBCFG_SCTM1)
#define CKCU_DBG_SCTM1_HALT     (1UL << 23)
#endif

#if (LIBCFG_SCTM2)
#define CKCU_DBG_SCTM2_HALT     (1UL << 24)
#endif

#if (LIBCFG_SCTM3)
#define CKCU_DBG_SCTM3_HALT     (1UL << 25)
#endif

#if (LIBCFG_CAN0)
#define CKCU_DBG_CAN0_HALT      (1UL << 26)
#endif

#if (LIBCFG_UART2)
#define CKCU_DBG_UART2_HALT     (1UL << 26)
#endif

#if (LIBCFG_UART3)
#define CKCU_DBG_UART3_HALT     (1UL << 27)
#endif

#if (LIBCFG_I2C2)
#define CKCU_DBG_I2C2_HALT      (1UL << 28)
#endif

#if (LIBCFG_PWM2)
#define CKCU_DBG_PWM2_HALT      (1UL << 29)
#endif

#if (LIBCFG_PWM0)
#define CKCU_DBG_PWM0_HALT      (1UL << 30)
#endif

#if (LIBCFG_PWM1)
#define CKCU_DBG_PWM1_HALT      (1UL << 31)
#endif

#define IS_CKCU_DBG(MODE)       (((MODE & ~(0xFFEFFFDF)) == 0) && (MODE != 0))

/* Definitions of AHB clock control                                                                         */
#define CKCU_AHBEN_SLEEP_FMC    (1UL)
#define CKCU_AHBEN_SLEEP_SRAM   (1UL << 2)
#define CKCU_AHBEN_SLEEP_BM     (1UL << 5)
#define CKCU_AHBEN_SLEEP_APB0   (1UL << 6)

#define IS_CKCU_SLEEP_AHB(PERIPH)  (((PERIPH & 0xFFFFFF9A) == 0) && (PERIPH != 0))

/* Definitions of HSI Ready Counter Value                                                                   */
#if (LIBCFG_CKCU_HSIRDYCR)
#define IS_COUNTER_VALUE(VALUE) ((VALUE) < 0x20)
#endif

#if (LIBCFG_CKCU_LSI_TRIM)
#define CKCU_LSITRIM_ACCURACY_0P0         (0)
#define CKCU_LSITRIM_ACCURACY_0P5         (8000 * 0.005)
#define CKCU_LSITRIM_ACCURACY_1P0         (8000 * 0.01)
#define CKCU_LSITRIM_ACCURACY_1P5         (8000 * 0.015)
#define CKCU_LSITRIM_ACCURACY_2P0         (8000 * 0.02)
#endif

/* HSE Gain mode                                                                                            */
#define CKCU_HSE_LOW_GAIN_MODE          ((0UL << 12) | (0UL << 8))
#define CKCU_HSE_MEDIUM_LOW_GAIN_MODE   ((0UL << 12) | (1UL << 8))
#define CKCU_HSE_MEDIUM_HIGH_GAIN_MODE  ((1UL << 12) | (0UL << 8))
#define CKCU_HSE_HIGH_GAIN_MODE         ((1UL << 12) | (1UL << 8))
/**
  * @}
  */

/* Exported functions --------------------------------------------------------------------------------------*/
/** @defgroup CKCU_Exported_Functions CKCU exported functions
  * @{
  */
void CKCU_DeInit(void);

void CKCU_HSICmd(ControlStatus Cmd);
void CKCU_HSECmd(ControlStatus Cmd);
bool CKCU_IS_HSI_USED(CKCU_HSIST_TypeDef Target);
bool CKCU_IS_HSE_USED(CKCU_HSEST_TypeDef Target);
FlagStatus CKCU_GetClockReadyStatus(u32 CKCU_FLAG);
ErrStatus CKCU_WaitHSEReady(void);

ErrStatus CKCU_SysClockConfig(CKCU_SW_TypeDef CLKSRC);
u32 CKCU_GetSysClockSource(void);

void CKCU_PeripClockConfig(CKCU_PeripClockConfig_TypeDef Clock, ControlStatus Cmd);

